n = int(input())
a = [0]*(n+1)
b = [0]*(n+1)
for i in range(2, n+1):
    a[i] = a[i-1]  # Допустим, минимальный способ - прибавить единицу
    if i % 3 == 0 and a[i//3] < a[i]:
        a[i] = a[i//3]  # Если минимальный способ - умножить на 3
    if i % 2 == 0 and a[i//2] < a[i]:
        a[i] = a[i//2]  # Если минимальный способ - умножить на 2
    a[i] += 1

i = n
while i > 1:
    if a[i] - 1 == a[i//3]:
        b[i] = 3
        i //= 3
    if a[i] - 1 == a[i//2]:
        b[i] = 2
        i //= 2
    if a[i] - 1 == a[i-1]:
        b[i] = 1
        i -= 1

for i in range(n, 0, -1):
    if b[i] != 0:
        print(b[i], end='')
